Конфигурация/InformationRegisters/ПодтверждениеОперацийБэкОфиса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ПодтверждениеОперацийБэкОфиса</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Подтверждена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПодтверждения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РучнойРежим</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПодтверждаемыеОперацииБэкОфиса</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/СтатусыЦенныхБумаг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СтатусыЦенныхБумаг</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЖизненныйЦиклЦенныхБумаг</v8:Type>
						<v8:Type>cfg:EnumRef.ТорговыеСтатусыЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Биржа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Биржи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ЗначенияДополнительныхСведений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияДополнительныхСведений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ДополнительныеСведения</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеСведения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/УсловияПравилПаевогоИнвестиционногоФонда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>УсловияПравилПаевогоИнвестиционногоФонда</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МинимальнаяСуммаЗачисления</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МинимальнаяСуммаЗачисленияЧерезАгента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредназначенДляКвалИнвесторов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокОплатыВознагражденияУК</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьВСЧАРезервыЗаВознаграждениеДепозитария</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьВСЧАРезервыЗаВознаграждениеУправляющего</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьВСЧАРезервыЗаПрочиеВозмещаемыеРасходыУправляющего</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачислятьРезервыЗаВознаграждениеДепозитарияВБэкОфисе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачислятьРезервыЗаВознаграждениеУправляющегоВБэкОфисе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачислятьРезервыЗаПрочиеВозмещаемыеРасходыУправляющегоВБэкОфисе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокОплатыПриЧастичномПогашении</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВестиУчетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаРасчетаРезервовЗаВознаграждениеУправляющего</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиРасчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаРасчетаРезервовЗаВознаграждениеДепозитария</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиРасчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаРасчетаРезервовЗаПрочиеВозмещаемыеРасходыУправляющего</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиРасчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантНачалаСрокаОплатыВознагражденияУК</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыНачалаСрока</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименяютсяНадбавкиИСкидкиПриЗачисленииИПогашенииПаев</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаРасчетаНадбавкиПриПриобретенииПаев</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиРасчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаРасчетаСкидкиПриПогашенииПаев</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиРасчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИндикаторДляОценкиРезультативностиУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БиржевыеИндексы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПаевойИнвестиционныйФонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/НастройкиФормированияСЧА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>НастройкиФормированияСЧА</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПериодичностьРасчетаСЧА</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиРегламентныхДействий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьРасчетныйКупон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НКДВСправедливойСтоимостиЦБ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантРасчетаПроцентовПоСделкамРЕПО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыРасчетаПроцентовПоСделкамРЕПО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТочностьРасчетнойСтавкиРЕПО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КритерийСущественностиОтклоненияССТПлюс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьНастройкиУчетнойПолитикиЕПС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодичностьНачисленияРезервов</Name>
					<Comment>#538027</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьПереоценкиАктивов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КорзинаОФЗПК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КорзиныОФЗПК</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПриостановленРасчетСЧА</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ФинансовыеПоказатели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ФинансовыеПоказатели</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СубъектАналитики</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
						<v8:Type>cfg:CatalogRef.СтратегииИндивидуальногоИнвестирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПоказателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыФинансовыхПоказателей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/ТипыПифовВЗависимостиОтЛиквидности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыПифовВЗависимостиОтЛиквидности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Открытый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрытый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интервальный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Биржевой</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/InformationRegisters/ПодтверждениеОперацийБэкОфиса/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ЭтаФорма.ЭтоСохраненнаяЗапись = Истина;	
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма, "Запись", "ИсходныйКлючЗаписи", Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.ЭтоКорректировкаЗаписи = (Параметры.Свойство("КорректировкаЗаписи") И Параметры.КорректировкаЗаписи);	
	ЭтаФорма.ЭтоОтменаПодтверждения = (Параметры.Свойство("ОтменаПодтверждения") И Параметры.ОтменаПодтверждения)
											ИЛИ (ЭтаФорма.ЭтоСохраненнаяЗапись И НЕ Запись.Подтверждена);
	
	ЗаполнитьРеквизитыПодтвержденияПИФ();
	
	Если ЭтаФорма.РежимПодтвержденияПИФ > 0 Тогда
		
		Элементы.Основание.Доступность = Ложь;
		Элементы.Основание.РежимВыбораИзСписка = Ложь;
		
	Иначе
		
		ДоступныеОснования = РегистрыСведений.ПодтверждениеОперацийБэкОфиса.ПолучитьДоступныеОснования();	
		Элементы.Основание.СписокВыбора.ЗагрузитьЗначения(ДоступныеОснования);	
	
	КонецЕсли; 
	
	Если Не ЭтаФорма.ЭтоСохраненнаяЗапись Тогда
		Запись.Подтверждена = Не ЭтаФорма.ЭтоОтменаПодтверждения;
		Запись.РучнойРежим = Истина;
		Если ЭтаФорма.РежимПодтвержденияПИФ > 0 Тогда
			Запись.Основание = "Подтверждено спец. депозитарием";
		КонецЕсли; 		
	КонецЕсли;

	ПриЧтенииСозданииНаСервере();	
	
	ЭтаФорма.ЭтоПолноправныйПользователь = РаботаСПользователями.ЭтоПолноправныйПользователь();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЭтаФорма.ЭтоСохраненнаяЗапись = Истина;	
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ПодтверждениеОперации", Запись.Операция);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)

	Если Не ЗавершениеРаботы Тогда
		Если ТекущаяЗаписьУдалена(Запись.ИсходныйКлючЗаписи) Тогда
			Оповестить("ПодтверждениеОперации", Запись.Операция);
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПодтвердитьОперацию(Команда)

	Если ЭтоСохраненнаяЗапись Тогда	
		
		ОповещениеПриЗакрытииДочернегоОкна = Новый ОписаниеОповещения("ПриЗакрытииДочернегоОкна", ЭтаФорма);
		
		ЗначенияЗаполнения = Новый Структура("Операция, Организация, Основание", Запись.Операция, Запись.Организация, Запись.Основание);
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
		
		ОткрытьФорму("РегистрСведений.ПодтверждениеОперацийБэкОфиса.ФормаЗаписи", ПараметрыФормы, ЭтаФорма, , , , ОповещениеПриЗакрытииДочернегоОкна, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	Иначе
		
		Если Не ПроверитьКорректностьДанных() Тогда
			Возврат;
		КонецЕсли;
		
		Если ЭтаФорма.РежимПодтвержденияПИФ = 2 Тогда
		
			ВыводитьПредупреждение = Ложь;
			
			Для каждого СтрокаСверкаСИнтерфакс Из ЭтаФорма.СверкаСИнтерфакс Цикл
				Если СтрокаСверкаСИнтерфакс.ЗначениеПоДанным1С <> СтрокаСверкаСИнтерфакс.ЗначениеПоДаннымИнтерфакс Тогда
					ВыводитьПредупреждение = Истина;
					Прервать;
				КонецЕсли; 
			КонецЦикла; 
			
			Если ВыводитьПредупреждение И Вопрос("Данные Интерфакс не совпадают с данными 1С. Подтвердить операцию?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
				Возврат;
			КонецЕсли; 
		
		КонецЕсли; 
		
		ЭтаФорма.Записать();
		ЭтаФорма.Закрыть(Истина);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомандаОтменитьПодтверждение(Команда)
	
	Если ЭтоСохраненнаяЗапись Тогда
		
		ОповещениеПриЗакрытииДочернегоОкна = Новый ОписаниеОповещения("ПриЗакрытииДочернегоОкна", ЭтаФорма);
		
		ЗначенияЗаполнения = Новый Структура("Операция, Организация, Основание", Запись.Операция, Запись.Организация, Запись.Основание);
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения, ОтменаПодтверждения", ЗначенияЗаполнения, Истина);
		
		ОткрытьФорму("РегистрСведений.ПодтверждениеОперацийБэкОфиса.ФормаЗаписи", ПараметрыФормы, ЭтаФорма, , , , ОповещениеПриЗакрытииДочернегоОкна, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	Иначе	
		
		Если Не ПроверитьКорректностьДанных() Тогда
			Возврат;
		КонецЕсли;
		
		ЭтаФорма.Записать();
		ЭтаФорма.Закрыть(Истина);	
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранитьИЗакрыть(Команда)

	Если Не ПроверитьКорректностьДанных() Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.Записать();
	ЭтаФорма.Закрыть(Истина);	
	
КонецПроцедуры	

&НаКлиенте
Процедура КомандаПодтвердитьИОтправить(Команда)
	
	Если Не ПроверитьКорректностьДанных() Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.Записать();
	
	Если Отправить() Тогда
		ПоказатьПредупреждение(Новый ОписаниеОповещения("КомандаПодтвердитьИОтправитьЗавершение", ЭтотОбъект, Новый Структура("ЗакрытьФорму", Истина)), "Выгрузка завершена");
	Иначе
		ЭтаФорма.ЭтоКорректировкаЗаписи = Истина;
		ЭтаФорма.ЭтоСохраненнаяЗапись = Истина;	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтправить(Команда)
	
	Если Не ЭтаФорма.ЭтоПодтверждениеПоследнейСЧА Тогда
		Если ЭтоПолноправныйПользователь Тогда
			ПоказатьВопрос(Новый ОписаниеОповещения("КомандаОтправитьЗавершение", ЭтотОбъект), "Внимание! Дата последнего расчета СЧА отличается от даты документа. Выполнить отправку на сайт?", РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет, "Внимание!");
		Иначе
			ДатаДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.Операция, "Дата");
			ПоказатьПредупреждение(Неопределено, СтрШаблон("Отправка возможна только за %1. Если необходимо выполнить отправку за %2 - обратитесь к администратору", Формат(ЭтаФорма.ДатаРасчетаСЧАНаТекущийМомент, "ДФ=dd.MM.yyyy"), Формат(ДатаДокумента, "ДФ=dd.MM.yyyy")));
		КонецЕсли; 
	Иначе
		ОтправитьБезПодтверждения();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтправитьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ОтправитьБезПодтверждения();
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьБезПодтверждения()
	
	Если Отправить() Тогда
		ПоказатьПредупреждение(Новый ОписаниеОповещения("КомандаПодтвердитьИОтправитьЗавершение", ЭтотОбъект, Новый Структура("ЗакрытьФорму", Ложь)), "Выгрузка завершена");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомандаПодтвердитьИОтправитьЗавершение(ДополнительныеПараметры) Экспорт
	
	Если ДополнительныеПараметры.ЗакрытьФорму Тогда
		ЭтаФорма.Закрыть(Истина);
	КонецЕсли; 

КонецПроцедуры

#Область Вспомогательные_функции

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	ТребуетсяОтправка = (ЭтаФорма.РежимПодтвержденияПИФ = 3 И ЭтаФорма.ЭтоПодтверждениеПоследнейСЧА)
			Или (ЭтаФорма.РежимПодтвержденияПИФ = 4 И ЭтаФорма.ДатаРасчетаСЧА >= '20210226')
			Или ЭтаФорма.РежимПодтвержденияПИФ = 5;
	
	Если ЭтаФорма.ЭтоКорректировкаЗаписи Тогда
	
		Элементы.ФормаПодтвердитьОперацию.Видимость				= Ложь;
		Элементы.ФормаКомандаПодтвердитьИОтправить.Видимость	= Ложь;
		Элементы.ФормаОтменитьПодтверждение.Видимость			= Ложь;
		Элементы.ФормаСохранитьИЗакрыть.Видимость				= Истина;	
		Элементы.ПредставлениеСтатуса.Видимость					= Ложь;
		Элементы.ГруппаПодтверждение.Видимость					= Истина;
		Элементы.ФормаКомандаОтправить.Видимость				= ТребуетсяОтправка И (ЭтоСохраненнаяЗапись <> ЭтоОтменаПодтверждения);
			
	Иначе
		
		Элементы.ФормаПодтвердитьОперацию.Видимость				= (ЭтоСохраненнаяЗапись = ЭтоОтменаПодтверждения) И Не ТребуетсяОтправка;
		Элементы.ФормаКомандаПодтвердитьИОтправить.Видимость	= (ЭтоСохраненнаяЗапись = ЭтоОтменаПодтверждения) И ТребуетсяОтправка;
		Элементы.ФормаОтменитьПодтверждение.Видимость			= (ЭтоСохраненнаяЗапись <> ЭтоОтменаПодтверждения);
		Элементы.ФормаСохранитьИЗакрыть.Видимость				= Ложь;	
		Элементы.ПредставлениеСтатуса.Видимость					= Истина;
		Элементы.ГруппаПодтверждение.Видимость					= Ложь;
		Элементы.ФормаКомандаОтправить.Видимость				= Ложь;
				
	КонецЕсли; 
	
	Элементы.ГруппаРеквизитыПодтвержденияПИФ.Видимость = ЭтаФорма.РежимПодтвержденияПИФ > 0;
	
	Элементы.ФормаПодтвердитьОперацию.КнопкаПоУмолчанию				= (Не ЭтаФорма.ЭтоКорректировкаЗаписи И Не ЭтоСохраненнаяЗапись И Не ЭтоОтменаПодтверждения И Не ТребуетсяОтправка);
	Элементы.ФормаКомандаПодтвердитьИОтправить.КнопкаПоУмолчанию	= (Не ЭтаФорма.ЭтоКорректировкаЗаписи И Не ЭтоСохраненнаяЗапись И Не ЭтоОтменаПодтверждения И ТребуетсяОтправка);
	Элементы.ФормаОтменитьПодтверждение.КнопкаПоУмолчанию			= (Не ЭтаФорма.ЭтоКорректировкаЗаписи И Не ЭтоСохраненнаяЗапись И ЭтоОтменаПодтверждения);
	
	Элементы.ФормаЗакрыть.КнопкаПоУмолчанию							= (Не ЭтаФорма.ЭтоКорректировкаЗаписи И ЭтоСохраненнаяЗапись);	
	Элементы.ФормаСохранитьИЗакрыть.КнопкаПоУмолчанию				= ЭтаФорма.ЭтоКорректировкаЗаписи;	
	
	ЭтаФорма.ТолькоПросмотр			= (Не ЭтаФорма.ЭтоКорректировкаЗаписи И ЭтоСохраненнаяЗапись);
	ЭтаФорма.Заголовок				= ?(ЭтоСохраненнаяЗапись, "Запись журнала подтверждений", ?(ЭтоОтменаПодтверждения, "Отмена подтверждения операции", "Подтверждение операции"));
	ЭтаФорма.ПредставлениеСтатуса	= ?(ЭтоСохраненнаяЗапись, ?(ЭтоОтменаПодтверждения, "Не подтверждена", "Подтверждена" + ?(Запись.РучнойРежим, " вручную", "")) , "");
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьКорректностьДанных()
	
	Отказ = Ложь;	
	
	Если Запись.Подтверждена И Не ЗначениеЗаполнено(Запись.Основание) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено поле ""Основание""", , "Запись.Основание", , Отказ);		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Запись.Период) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено поле ""Время записи""", , "Запись.Период", , Отказ);		
	КонецЕсли;	
	
	Если Не Отказ И Запись.Подтверждена Тогда
		ВремяОперации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.Операция, "Дата");
		
		Если Запись.Период < ВремяОперации Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Время подтверждения не должно быть раньше времени операции " + Строка(ВремяОперации), , , , Отказ);		
		КонецЕсли;
	КонецЕсли;	
	
	Если Не Отказ Тогда
		
		Если ЭтоСохраненнаяЗапись Тогда
			
			ИсходнаяЗапись		= ПолучитьИсходнуюЗапись(Запись.ИсходныйКлючЗаписи);
			ВремяКрайнейЗаписи	= Неопределено;
			
			Если ЭтоПерваяЗапись(ИсходнаяЗапись) Тогда
				Если ЕстьБолееРанниеЗаписи(ИсходнаяЗапись, Запись.Период, ВремяКрайнейЗаписи) Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Время записи должно быть раньше " + Строка(ВремяКрайнейЗаписи), , , , Отказ);		
				КонецЕсли;
			ИначеЕсли ЭтоПоследняяЗапись(ИсходнаяЗапись) Тогда
				Если ЕстьБолееПоздниеЗаписи(ИсходнаяЗапись, Запись.Период, ВремяКрайнейЗаписи) Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Время записи должно быть позже " + Строка(ВремяКрайнейЗаписи), , , , Отказ);		
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			
			ПоследняяЗаписьЖурналаПодтверждений = ПолучитьПоследнююЗаписьЖурналаПодтверждений(Запись.Операция);
			Если ПоследняяЗаписьЖурналаПодтверждений <> Неопределено Тогда
				Если ЭтоОтменаПодтверждения <> ПоследняяЗаписьЖурналаПодтверждений.Подтверждена Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Запись о подтверждении\отмене подтверждения внесена другим пользователем " + Строка(ПоследняяЗаписьЖурналаПодтверждений.Период), , , , Отказ);		
				ИначеЕсли ПоследняяЗаписьЖурналаПодтверждений.Период >= Запись.Период Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Время добавляемой записи " + Строка(Запись.Период) + " должно быть позже времени последней записи журнала " + Строка(ПоследняяЗаписьЖурналаПодтверждений.Период), , , , Отказ);		
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЕсли;
	
	Возврат (Не Отказ); 	
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьИсходнуюЗапись(КлючЗаписи)
	
	ИсходнаяЗапись = Новый Структура("Организация, Операция, Период");
	
	ЗаполнитьЗначенияСвойств(ИсходнаяЗапись, КлючЗаписи); 
	
	Возврат ИсходнаяЗапись;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЭтоПерваяЗапись(ИсходнаяЗапись)
	
	ПерваяЗапись = РегистрыСведений.ПодтверждениеОперацийБэкОфиса.ПолучитьПервуюЗаписьЖурналаПодтверждений(ИсходнаяЗапись.Операция);	
	Если ЗначениеЗаполнено(ПерваяЗапись) И ПерваяЗапись.Период <> ИсходнаяЗапись.Период Тогда
		Возврат Ложь;
	КонецЕсли;
		
	Возврат Истина;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЕстьБолееРанниеЗаписи(ИсходнаяЗапись, НовоеВремяЗаписи, ВремяКрайнейЗаписи = Неопределено)
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ПодтверждениеОперацийБэкОфиса.Период КАК Период
		|ИЗ
		|	РегистрСведений.ПодтверждениеОперацийБэкОфиса КАК ПодтверждениеОперацийБэкОфиса
		|ГДЕ
		|	ПодтверждениеОперацийБэкОфиса.Операция = &Операция
		|	И ПодтверждениеОперацийБэкОфиса.Организация = &Организация
		|	И ПодтверждениеОперацийБэкОфиса.Период <> &Период
		|	И ПодтверждениеОперацийБэкОфиса.Период <= &НовоеВремяЗаписи
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПодтверждениеОперацийБэкОфиса.Период");
	Запрос.УстановитьПараметр("Операция", ИсходнаяЗапись.Операция);
	Запрос.УстановитьПараметр("Организация", ИсходнаяЗапись.Организация);
	Запрос.УстановитьПараметр("Период", ИсходнаяЗапись.Период);
	Запрос.УстановитьПараметр("НовоеВремяЗаписи", НовоеВремяЗаписи);	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ВремяКрайнейЗаписи = Неопределено;
		Возврат Ложь;
	Иначе
		ВремяКрайнейЗаписи = РезультатЗапроса.Выгрузить()[0].Период;
		Возврат Истина;
	КонецЕсли;	

КонецФункции

&НаСервереБезКонтекста
Функция ЭтоПоследняяЗапись(ИсходнаяЗапись)
	
	ПоследняяЗапись = РегистрыСведений.ПодтверждениеОперацийБэкОфиса.ПолучитьПоследнююЗаписьЖурналаПодтверждений(ИсходнаяЗапись.Операция);	
	Если ЗначениеЗаполнено(ПоследняяЗапись) И ПоследняяЗапись.Период <> ИсходнаяЗапись.Период Тогда
		Возврат Ложь;
	КонецЕсли;
		
	Возврат Истина;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЕстьБолееПоздниеЗаписи(ИсходнаяЗапись, НовоеВремяЗаписи, ВремяКрайнейЗаписи = Неопределено)
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ПодтверждениеОперацийБэкОфиса.Период КАК Период
		|ИЗ
		|	РегистрСведений.ПодтверждениеОперацийБэкОфиса КАК ПодтверждениеОперацийБэкОфиса
		|ГДЕ
		|	ПодтверждениеОперацийБэкОфиса.Операция = &Операция
		|	И ПодтверждениеОперацийБэкОфиса.Организация = &Организация
		|	И ПодтверждениеОперацийБэкОфиса.Период <> &Период
		|	И ПодтверждениеОперацийБэкОфиса.Период >= &НовоеВремяЗаписи
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПодтверждениеОперацийБэкОфиса.Период УБЫВ");
	Запрос.УстановитьПараметр("Операция", ИсходнаяЗапись.Операция);
	Запрос.УстановитьПараметр("Организация", ИсходнаяЗапись.Организация);
	Запрос.УстановитьПараметр("Период", ИсходнаяЗапись.Период);
	Запрос.УстановитьПараметр("НовоеВремяЗаписи", НовоеВремяЗаписи);	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ВремяКрайнейЗаписи = Неопределено;
		Возврат Ложь;
	Иначе
		ВремяКрайнейЗаписи = РезультатЗапроса.Выгрузить()[0].Период;
		Возврат Истина;
	КонецЕсли;	
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПоследнююЗаписьЖурналаПодтверждений(Операция)
	
	Возврат РегистрыСведений.ПодтверждениеОперацийБэкОфиса.ПолучитьПоследнююЗаписьЖурналаПодтверждений(Операция); 	
	
КонецФункции

&НаКлиенте
Процедура ПриЗакрытииДочернегоОкна(Параметр, ДополнительныеПараметры) Экспорт
	
	Если Параметр <> Неопределено Тогда 
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекущаяЗаписьУдалена(КлючЗаписи)
	
	МенеждерЗаписи = РегистрыСведений.ПодтверждениеОперацийБэкОфиса.СоздатьМенеджерЗаписи();
	
	ЗаполнитьЗначенияСвойств(МенеждерЗаписи, КлючЗаписи);
	
	МенеждерЗаписи.Прочитать();
	
	Возврат Не МенеждерЗаписи.Выбран();
	
КонецФункции
 
&НаСервере
Процедура ЗаполнитьРеквизитыПодтвержденияПИФ()

	ЭтаФорма.РежимПодтвержденияПИФ = 0;
	Элементы.ГруппаСверкаСИнтерфакс.Видимость = Ложь;
	
	Если ТипЗнч(Запись.Операция) = Тип("ДокументСсылка.РегистрацияСтоимостиАктивов") Тогда
		
		// Режммы работы формы для разных ПИФов:
		// 0. Обычная форма подтверждения (не ПИФ)
		// 1. Отправка не поддерживается (закрытый ПИФ, паи не торгуются на бирже)
		// 2. Необходима сверка с Интерфаксом (паи торгуются на бирже)
		// 3. Поддерживается выгрузка в матрикс и на сайт в момент подтверждения (открытый ПИФ, паи не торгуются на бирже либо данные уже отправлены на сайт Интерфакс и совпадают с данными системы)
		// 4. Поддерживается выгрузка в матрикс и отправка оповещений в момент подтверждения (закрытый ПИФ, предназначенный для квалифицированных инвесторов)
		// 5. Поддерживается выгрузка в матрикс, на сайт и отправка оповещений в момент подтверждения (закрытый ПИФ, прописан адрес сайта)
		
		Запрос = Новый Запрос;
		РеквизитыРСА = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Запись.Операция, "Организация, СчетДоверительногоУправления, Дата");
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", РеквизитыРСА.СчетДоверительногоУправления);
		Запрос.УстановитьПараметр("Организация", РеквизитыРСА.Организация);
		Запрос.УстановитьПараметр("Период", РеквизитыРСА.Дата);
		
		#Область ТекстЗапроса
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ПаевыеИнвестиционныеФонды.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыПифовВЗависимостиОтЛиквидности.Закрытый) КАК Закрытый,
			|	ЕСТЬNULL(СтатусыЦенныхБумагСрезПоследних.Активен, ЛОЖЬ) КАК ТоргуетсяНаБирже,
			|	ЗначенияДополнительныхСведенийИнтерфакс.Значение КАК АдресСайтаИнтерфакс,
			|	ЕСТЬNULL(ЗначенияДополнительныхСведенийСайт.Значение, """") КАК АдресСайтаПИФ,
			|	УсловияПравилПаевогоИнвестиционногоФондаСрезПоследних.ПредназначенДляКвалИнвесторов КАК ПредназначенДляКвалИнвесторов
			|ИЗ
			|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПаевыеИнвестиционныеФонды КАК ПаевыеИнвестиционныеФонды
			|		ПО КлиентыДоверительногоУправленияСрезПоследних.Клиент = ПаевыеИнвестиционныеФонды.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Паи КАК Паи
			|		ПО (Паи.ПаевойИнвестиционныйФонд = КлиентыДоверительногоУправленияСрезПоследних.Клиент)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыЦенныхБумаг.СрезПоследних(
			|				&Период,
			|				Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи)
			|					И Статус = ЗНАЧЕНИЕ(Перечисление.ТорговыеСтатусыЦенныхБумаг.ТоргуетсяНаБирже)) КАК СтатусыЦенныхБумагСрезПоследних
			|		ПО (Паи.Ссылка = СтатусыЦенныхБумагСрезПоследних.ЦеннаяБумага)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведенийИнтерфакс
			|		ПО (ЗначенияДополнительныхСведенийИнтерфакс.Объект = &Организация)
			|			И (ЗначенияДополнительныхСведенийИнтерфакс.Свойство.Ключ = ""Обработка.ОтправкаДанныхПИФНаСайтИнтерфакс"")
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведенийСайт
			|		ПО (ЗначенияДополнительныхСведенийСайт.Объект = &СчетДоверительногоУправления)
			|			И (ЗначенияДополнительныхСведенийСайт.Свойство.Ключ = ""Обработка.ОтправкаДанныхПИФНаСайт"")
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияПравилПаевогоИнвестиционногоФонда.СрезПоследних(&Период, ) КАК УсловияПравилПаевогоИнвестиционногоФондаСрезПоследних
			|		ПО КлиентыДоверительногоУправленияСрезПоследних.Клиент = УсловияПравилПаевогоИнвестиционногоФондаСрезПоследних.ПаевойИнвестиционныйФонд";			
		#КонецОбласти 
		
		ЭтоРПИ = РеквизитыРСА.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РПИ");
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
		
			ЭтаФорма.ДатаРасчетаСЧА = РеквизитыРСА.Дата;
			ЭтаФорма.ПредыдущаяДатаРасчетаСЧА = Справочники.НастройкиРегламентныхДействий.ПолучитьДатуПредыдущегоРасчетаСЧА(РеквизитыРСА.СчетДоверительногоУправления, РеквизитыРСА.Дата);
			
			Если ЭтоРПИ Тогда
				// хардкод: В УКПИ бывают ЗПИФ с ежедневными расчётом СЧА, выгрузкой на сайт и в Матрикс
				// А есть, которые торгуются на бирже, но выгружаются ежемесячно, в т.ч. на Интерфакс
				Если Выборка.Закрытый Тогда
					ЭтаФорма.ДатаРасчетаСЧАНаТекущийМомент = Справочники.НастройкиРегламентныхДействий.ПолучитьДатуПредыдущегоРасчетаСЧА(РеквизитыРСА.СчетДоверительногоУправления, НачалоДня(ТекущаяДатаСеанса()), Ложь);
					ЭтаФорма.ЭтоПодтверждениеПоследнейСЧА = (ЭтаФорма.ДатаРасчетаСЧАНаТекущийМомент = НачалоДня(РеквизитыРСА.Дата));
					Если (ЭтаФорма.ЭтоПодтверждениеПоследнейСЧА) И (Не ПустаяСтрока(Выборка.АдресСайтаПИФ)) Тогда
						Если ДанныеНаСайтВыгружены(РеквизитыРСА.Организация, РеквизитыРСА.СчетДоверительногоУправления, Выборка.АдресСайтаПИФ) Тогда
							ЭтаФорма.РежимПодтвержденияПИФ = 4;
						Иначе
							ЭтаФорма.РежимПодтвержденияПИФ = 5;
						КонецЕсли;
					ИначеЕсли ЭтаФорма.ЭтоПодтверждениеПоследнейСЧА И Выборка.ПредназначенДляКвалИнвесторов Тогда
						ЭтаФорма.РежимПодтвержденияПИФ = 4;
					Иначе
						ЭтаФорма.РежимПодтвержденияПИФ = 1;
					КонецЕсли;
				Иначе
					ЭтаФорма.ДатаРасчетаСЧАНаТекущийМомент = РегистрыСведений.НастройкиФормированияСЧА.ПолучитьБлижайшуюДатуФормированияСЧА(РеквизитыРСА.Организация, РеквизитыРСА.СчетДоверительногоУправления, НачалоДня(ТекущаяДатаСеанса())-1);
					ЭтаФорма.ЭтоПодтверждениеПоследнейСЧА = (ЭтаФорма.ДатаРасчетаСЧАНаТекущийМомент = НачалоДня(РеквизитыРСА.Дата));
					ЭтаФорма.РежимПодтвержденияПИФ = 3;
				КонецЕсли; 

				Если ЭтаФорма.ЭтоПодтверждениеПоследнейСЧА Тогда
					Если Выборка.ТоргуетсяНаБирже И Не ДанныеНаСайтеИнтерфаксКорректны(Выборка, РеквизитыРСА) Тогда
						ЭтаФорма.РежимПодтвержденияПИФ = 2;
					КонецЕсли;
					Элементы.ГруппаСверкаСИнтерфакс.Видимость = Выборка.ТоргуетсяНаБирже И (Не ПустаяСтрока(Выборка.АдресСайтаИнтерфакс));
					Элементы.КомандаПолучитьДанныеИнтерфаксИзБуфераОбмена.Видимость = (ЭтаФорма.РежимПодтвержденияПИФ = 2);
				КонецЕсли;
				
				Элементы.ДекорацияБиржевойПИФ_2.Видимость         = (ЭтаФорма.РежимПодтвержденияПИФ = 2);
				Элементы.ДекорацияКартинкаБиржевойПИФ_2.Видимость = (ЭтаФорма.РежимПодтвержденияПИФ = 2);
				Элементы.ДекорацияБиржевойПИФ_3.Видимость         = (ЭтаФорма.РежимПодтвержденияПИФ = 3);
				
				Если ЭтаФорма.ДатаРасчетаСЧАНаТекущийМомент = НачалоДня(РеквизитыРСА.Дата) Тогда
					Элементы.ДатаРасчетаСЧАНаТекущийМомент.ЦветТекста = WebЦвета.Зеленый;
				КонецЕсли; 
			Иначе
				Если Выборка.Закрытый Тогда
					// хардкод: ЗПИФ по методике рассчитывается в последний рабочий день месяца. СЧА на сайт не выгружаем
					ЭтаФорма.ДатаРасчетаСЧАНаТекущийМомент = Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Справочники.Календари.Общероссийский, НачалоМесяца(ТекущаяДатаСеанса())-1);
					Если Выборка.ПредназначенДляКвалИнвесторов Тогда
						ЭтаФорма.РежимПодтвержденияПИФ = 4;
					Иначе
						ЭтаФорма.РежимПодтвержденияПИФ = 1;
					КонецЕсли; 
				Иначе
					ЭтаФорма.ДатаРасчетаСЧАНаТекущийМомент = РегистрыСведений.НастройкиФормированияСЧА.ПолучитьБлижайшуюДатуФормированияСЧА(РеквизитыРСА.Организация, РеквизитыРСА.СчетДоверительногоУправления, НачалоДня(ТекущаяДатаСеанса())-1);
					ЭтаФорма.ЭтоПодтверждениеПоследнейСЧА  = (ЭтаФорма.ДатаРасчетаСЧАНаТекущийМомент = НачалоДня(РеквизитыРСА.Дата));
					ЭтаФорма.РежимПодтвержденияПИФ = 3;
				КонецЕсли; 
										
				Если Выборка.ТоргуетсяНаБирже И Не ДанныеНаСайтеИнтерфаксКорректны(Выборка, РеквизитыРСА) Тогда
					ЭтаФорма.РежимПодтвержденияПИФ = 2;
				КонецЕсли;
				
				Элементы.ГруппаСверкаСИнтерфакс.Видимость = Выборка.ТоргуетсяНаБирже;
				Элементы.КомандаПолучитьДанныеИнтерфаксИзБуфераОбмена.Видимость = (ЭтаФорма.РежимПодтвержденияПИФ = 2);
				
				Элементы.ДекорацияБиржевойПИФ_2.Видимость         = (ЭтаФорма.РежимПодтвержденияПИФ = 2);
				Элементы.ДекорацияКартинкаБиржевойПИФ_2.Видимость = (ЭтаФорма.РежимПодтвержденияПИФ = 2);
				Элементы.ДекорацияБиржевойПИФ_3.Видимость         = (ЭтаФорма.РежимПодтвержденияПИФ = 3);
				
				Если ЭтаФорма.ДатаРасчетаСЧАНаТекущийМомент = НачалоДня(РеквизитыРСА.Дата) Тогда
					Элементы.ДатаРасчетаСЧАНаТекущийМомент.ЦветТекста = WebЦвета.Зеленый;
				КонецЕсли; 
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЕсли; 

КонецПроцедуры

&НаСервере
Функция ДанныеНаСайтВыгружены(Организация, СчетДоверительногоУправления, АдресСайтаПИФ)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Период", ЭтаФорма.ДатаРасчетаСЧА);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ФинансовыеПоказатели.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
		|ГДЕ
		|	ФинансовыеПоказатели.Активность
		|	И ФинансовыеПоказатели.Период = &Период
		|	И ФинансовыеПоказатели.СубъектАналитики = &СчетДоверительногоУправления
		|	И ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок)
		|;";
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		СтоимостиССайтаКомпании = Обработки.ОтправкаДанныхПИФНаСайт.ПолучитьСтоимостиССайтаКомпании(Организация, АдресСайтаПИФ, ЭтаФорма.ДатаРасчетаСЧА);
		Если СтоимостиССайтаКомпании.СЧА = Выборка.Значение Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции

&НаСервере
Функция ДанныеНаСайтеИнтерфаксКорректны(ДанныеПИФ, ДанныеРСА)

	Если ПустаяСтрока(ДанныеПИФ.АдресСайтаИнтерфакс) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЮрФизЛицо", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеРСА.Организация, "ЮрФизЛицо"));
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ДанныеРСА.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Период", ЭтаФорма.ДатаРасчетаСЧА);
	Запрос.УстановитьПараметр("ПредыдущийПериод", ЭтаФорма.ПредыдущаяДатаРасчетаСЧА);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ФинансовыеПоказатели.Период КАК Период,
		|	ФинансовыеПоказатели.ВидПоказателя КАК ВидПоказателя,
		|	ФинансовыеПоказатели.Значение КАК Значение
		|ПОМЕСТИТЬ _ФинансовыеПоказатели
		|ИЗ
		|	РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
		|ГДЕ
		|	ФинансовыеПоказатели.Активность
		|	И ФинансовыеПоказатели.Период В (&Период, &ПредыдущийПериод)
		|	И ФинансовыеПоказатели.СубъектАналитики = &СчетДоверительногоУправления
		|	И ФинансовыеПоказатели.ВидПоказателя В (ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьПая), ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу КАК ПолноеНаименованиеПоУставу,
		|	ЕСТЬNULL(_СЧА.Значение, 0) КАК СЧА,
		|	ЕСТЬNULL(_СтоимостьПая.Значение, 0) КАК СтоимостьПая,
		|	ЕСТЬNULL(_ПредыдущаяСЧА.Значение, 0) КАК ПредыдущаяСЧА,
		|	ЕСТЬNULL(_ПредыдущаяСтоимостьПая.Значение, 0) КАК ПредыдущаяСтоимостьПая
		|ИЗ
		|	РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|			&Период,
		|			Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|				И ЮрФизЛицо = &ЮрФизЛицо) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ФинансовыеПоказатели КАК _СЧА
		|		ПО (_СЧА.Период = &Период)
		|			И (_СЧА.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок))
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ФинансовыеПоказатели КАК _СтоимостьПая
		|		ПО (_СтоимостьПая.Период = &Период)
		|			И (_СтоимостьПая.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьПая))
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ФинансовыеПоказатели КАК _ПредыдущаяСЧА
		|		ПО (_ПредыдущаяСЧА.Период = &ПредыдущийПериод)
		|			И (_ПредыдущаяСЧА.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок))
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ФинансовыеПоказатели КАК _ПредыдущаяСтоимостьПая
		|		ПО (_ПредыдущаяСтоимостьПая.Период = &ПредыдущийПериод)
		|			И (_ПредыдущаяСтоимостьПая.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьПая))";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Выборка.Следующий();
	Отказ = Ложь;
	
	СтоимостиССайтаИнтерфакс = РаботаСВнешнимиСистемамиКлиентСервер.ПолучиьСтоимостиССайтаИнтерфакс(ДанныеПИФ.АдресСайтаИнтерфакс, Выборка.ПолноеНаименованиеПоУставу, ЭтаФорма.ДатаРасчетаСЧА, ЭтаФорма.ПредыдущаяДатаРасчетаСЧА);
	ЭтаФорма.СверкаСИнтерфакс.Очистить();
	
	Для каждого КлючЗначение Из СтоимостиССайтаИнтерфакс Цикл
		
		НоваяСтрока = ЭтаФорма.СверкаСИнтерфакс.Добавить();
		НоваяСтрока.Ключ = КлючЗначение.Ключ;
		НоваяСтрока.Показатель = ПолучитьИмяПоказателя(КлючЗначение.Ключ);
		НоваяСтрока.ЗначениеПоДанным1С = Выборка[КлючЗначение.Ключ];
		НоваяСтрока.ЗначениеПоДаннымИнтерфакс = КлючЗначение.Значение;
		
		Отказ = Отказ Или (КлючЗначение.Значение <> Выборка[КлючЗначение.Ключ]);
		
	КонецЦикла; 
	
	Возврат Не Отказ;

КонецФункции

&НаСервере
Функция ПолучитьИмяПоказателя(Ключ)

	Период = ?(СтрНачинаетсяС(Ключ, "Предыдущая"), ЭтаФорма.ПредыдущаяДатаРасчетаСЧА, ЭтаФорма.ДатаРасчетаСЧА);
	ИмяПоказателя = ?(СтрЗаканчиваетсяНа(Ключ, "СЧА"), "Стоимость чистых активов, руб., на ", "Расчетная стоимость инвестиционного пая руб, на ");
	
	Возврат ИмяПоказателя + Формат(Период, "ДФ=dd.MM.yyyy")

КонецФункции
 
&НаКлиенте
Функция Отправить()

	ДатаВыгрузки = ТекущаяДата();
	Если Не (ВвестиДату(ДатаВыгрузки, "Дата публикации на сайте") И ЗначениеЗаполнено(ДатаВыгрузки)) Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	РеквизитыОперации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Запись.Операция, "Организация, Дата, СчетДоверительногоУправления");
	РеквизитыОперации.Вставить("ПутьКФайлу", 		КаталогВременныхФайлов() + "xml.xml");
	РеквизитыОперации.Вставить("Брокер", 			ОбщегоНазначения.ПолучитьИменованныйОбъект("Брокер_БК_Регион"));
	РеквизитыОперации.Вставить("ДатаПодтверждения", ДатаВыгрузки);
	
	ПараметрыФормы = Новый Структура("ПараметрыОбработки, ЭтоПодтверждениеСЧА", РеквизитыОперации, Истина); 
	
	Попытка
		ФормаОбработки = ПолучитьФорму("Обработка.ОтправкаДанныхПИФНаСайт.Форма.Форма", ПараметрыФормы, ЭтаФорма, ЭтаФорма);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Недостаточно прав для отправки данных ПИФ на сайт");
		Возврат Ложь;
	КонецПопытки;
	
	Если РежимПодтвержденияПИФ = 4 Тогда
		Возврат ФормаОбработки.ОтправитьВMatrix();
	Иначе
		Возврат ФормаОбработки.Выгрузить() И ФормаОбработки.Отправить(Истина);
	КонецЕсли; 

КонецФункции

&НаКлиенте
Процедура КомандаПолучитьДанныеИнтерфаксИзБуфераОбмена(Команда)
	
	Для каждого СтрокаСверкаСИнтерфакс Из ЭтаФорма.СверкаСИнтерфакс Цикл
		СтрокаСверкаСИнтерфакс.ЗначениеПоДаннымИнтерфакс = 0;
	КонецЦикла; 
	
	Попытка
		COMОбъект = Новый COMОбъект("htmlfile");
		Буфер = COMОбъект.ParentWindow.ClipboardData.Getdata("text");
	Исключение
		ВвестиСтроку(Буфер, "Не удалось получить данные из буфера обмена.
			|Вставьте данные вручную", , Истина);
		ДобавитьЗаписьОбОшибке(Запись.Операция);
	КонецПопытки;
		
	Если СтрЧислоСтрок(Буфер) <> 13 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Формат данных в буфере обмена не соответствует формату данных Интерфакс");
		Возврат;
	КонецЕсли;
	
	ФорматДаты = "ДФ=dd.MM.yyyy";
	
	Попытка
		
		ДатаРасчетаСЧАИнтерфакс = Дата(СтрПолучитьСтроку(Буфер, 4) + " 00:00:00");
		
		Если ЭтаФорма.ДатаРасчетаСЧА <> ДатаРасчетаСЧАИнтерфакс Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата подтверждаемой СЧА '" + Формат(ЭтаФорма.ДатаРасчетаСЧА, ФорматДаты) + 
				"' не соответствует дате в буфере обмена '" + Формат(ДатаРасчетаСЧАИнтерфакс, ФорматДаты) + "'");
			Возврат;	
		КонецЕсли; 
		
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В буфере обмена не удалось найти текущую дату");
		Возврат;
	КонецПопытки; 
	
	Попытка
		
		ПредыдущаяДатаРасчетаСЧАИнтерфакс = Дата(СтрПолучитьСтроку(Буфер, 2) + " 00:00:00");
		
		Если ЭтаФорма.ПредыдущаяДатаРасчетаСЧА <> ПредыдущаяДатаРасчетаСЧАИнтерфакс Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Предыдущая дата по данным 1С '" + Формат(ЭтаФорма.ПредыдущаяДатаРасчетаСЧА, ФорматДаты) + 
				"' не соответствует дате в буфере обмена '" + Формат(ПредыдущаяДатаРасчетаСЧАИнтерфакс, ФорматДаты) + "'");
			Возврат;	
		КонецЕсли; 
		
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В буфере обмена не удалось найти предыдущую дату");
		Возврат;
	КонецПопытки; 
	
	СтоимостиИнтерфакс = Новый Структура("СтоимостьПая, СЧА, ПредыдущаяСтоимостьПая, ПредыдущаяСЧА", 
		СтрПолучитьСтроку(Буфер, 12),
		СтрПолучитьСтроку(Буфер, 8),
		СтрПолучитьСтроку(Буфер, 11),
		СтрПолучитьСтроку(Буфер, 7));
		
	Для каждого СтоимостьИнтерфакс Из СтоимостиИнтерфакс Цикл
	
		Попытка
			СтоимостиИнтерфакс[СтоимостьИнтерфакс.Ключ] = Число(СтоимостьИнтерфакс.Значение);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В буфере обмена не удалось найти показатель '" + ПолучитьИмяПоказателя(СтоимостьИнтерфакс.Ключ) + "'");
			СтоимостиИнтерфакс[СтоимостьИнтерфакс.Ключ] = 0;
		КонецПопытки; 
		
		НайденныеСтроки = ЭтаФорма.СверкаСИнтерфакс.НайтиСтроки(Новый Структура("Ключ", СтоимостьИнтерфакс.Ключ));
		НайденныеСтроки[0].ЗначениеПоДаннымИнтерфакс = СтоимостьИнтерфакс.Значение;
		
	КонецЦикла; 
		
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьЗаписьОбОшибке(Ссылка)

	Описание = "Не удалось получить информацию из буфера обмена";
	
	НоваяЗадача = Задачи.ОшибкиРегламентыхЗаданий.СоздатьЗадачу();
	НоваяЗадача.Дата = ТекущаяДатаСеанса();
	НоваяЗадача.Наименование = Описание;
	НоваяЗадача.ТекстЗадачи = Описание;
	НоваяЗадача.Источник = "Подтверждение СЧА ПИФ по документу " + Ссылка;
	НоваяЗадача.ГруппаПользователей = Справочники.ГруппыПользователей.ВсеПользователи;
	НоваяЗадача.Записать();	

КонецПроцедуры

#КонецОбласти
